app/views/predictions/new.html.haml

    = f.label :user_id, 'Who?'
    = f.select :user_id, @users.collect { |u| [ u.username, u.id ] },
      prompt: 'Select User'
  .form-group
---
SELECT "users".* FROM "users"