app/controllers/predictions_controller.rb

SELECT "users".* FROM "users"
---
  def new
    @prediction = Prediction.new
    @users = User.all

INSERT INTO "predictions" ("created_at", "date", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-10-22 05:53:59.237885"], ["date", "2014-10-23"], ["updated_at", "2014-10-22 05:53:59.237885"], ["user_id", 54]]
---
  def create
    @prediction = Prediction.new(params[:prediction].permit(:user_id, :date))

    if @prediction.save